{
  "architectures": [
    "VitPoseForPoseEstimation"
  ],
  "backbone": null,
  "backbone_config": {
    "model_type": "vitpose_backbone",
    "num_experts": 6,
    "out_features": [
      "stage12"
    ],
    "out_indices": [
      12
    ],
    "part_features": 192
  },
  "backbone_kwargs": null,
  "edges": [
    [
      15,
      13
    ],
    [
      13,
      11
    ],
    [
      16,
      14
    ],
    [
      14,
      12
    ],
    [
      11,
      12
    ],
    [
      5,
      11
    ],
    [
      6,
      12
    ],
    [
      5,
      6
    ],
    [
      5,
      7
    ],
    [
      6,
      8
    ],
    [
      7,
      9
    ],
    [
      8,
      10
    ],
    [
      1,
      2
    ],
    [
      0,
      1
    ],
    [
      0,
      2
    ],
    [
      1,
      3
    ],
    [
      2,
      4
    ],
    [
      3,
      5
    ],
    [
      4,
      6
    ]
  ],
  "id2label": {
    "0": "Nose",
    "1": "L_Eye",
    "2": "R_Eye",
    "3": "L_Ear",
    "4": "R_Ear",
    "5": "L_Shoulder",
    "6": "R_Shoulder",
    "7": "L_Elbow",
    "8": "R_Elbow",
    "9": "L_Wrist",
    "10": "R_Wrist",
    "11": "L_Hip",
    "12": "R_Hip",
    "13": "L_Knee",
    "14": "R_Knee",
    "15": "L_Ankle",
    "16": "R_Ankle"
  },
  "initializer_range": 0.02,
  "label2id": {
    "L_Ankle": 15,
    "L_Ear": 3,
    "L_Elbow": 7,
    "L_Eye": 1,
    "L_Hip": 11,
    "L_Knee": 13,
    "L_Shoulder": 5,
    "L_Wrist": 9,
    "Nose": 0,
    "R_Ankle": 16,
    "R_Ear": 4,
    "R_Elbow": 8,
    "R_Eye": 2,
    "R_Hip": 12,
    "R_Knee": 14,
    "R_Shoulder": 6,
    "R_Wrist": 10
  },
  "model_type": "vitpose",
  "scale_factor": 4,
  "torch_dtype": "float32",
  "transformers_version": "4.47.0.dev0",
  "use_pretrained_backbone": false,
  "use_simple_decoder": false,
  "use_timm_backbone": false
}
